#Generated by Fabric Compiler ( version 2024.2 <build 178169> ) at Mon Jul  6 09:15:00 2026

add_design E:/FPGA/ainuo/BTS7501/master/prj/project/ipcore/CLK_PLL/CLK_PLL.idf
add_design E:/FPGA/ainuo/BTS7501/master/prj/project/ipcore/SPI_FIFO_MISO1/SPI_FIFO_MISO1.idf
add_design E:/FPGA/ainuo/BTS7501/master/prj/project/ipcore/SPI_FIFO_MISO2/SPI_FIFO_MISO2.idf
add_design E:/FPGA/ainuo/BTS7501/master/prj/project/ipcore/SPI_FIFO_MISO3/SPI_FIFO_MISO3.idf
add_design E:/FPGA/ainuo/BTS7501/master/prj/project/ipcore/SPI_FIFO_MISO4/SPI_FIFO_MISO4.idf
add_design E:/FPGA/ainuo/BTS7501/master/prj/project/ipcore/FIFO_TX/FIFO_TX.idf
add_design E:/FPGA/ainuo/BTS7501/master/prj/project/ipcore/FIFO_RX/FIFO_RX.idf
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/COM_ANALYSE.v"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/define.v"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/EDGE_CKECK.v"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/FT600Q_DRIVE.v"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/MASTER_TOP.v"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/PULSE_EXPAND.v"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/SPI_DRIVE.v"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/CLK_DRIVER.v"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/ADS1247_DRIVE.v"
add_constraint "E:/FPGA/ainuo/BTS7501/master/prj/project/source/pin.fdc"
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
add_constraint "E:/FPGA/ainuo/BTS7501/master/prj/project/source/pin_7_extracted.fdc"
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
add_design "E:/FPGA/ainuo/BTS7501/master/prj/project/ipcore/CLK_PLL/CLK_PLL.idf"
add_design "E:/FPGA/ainuo/BTS7501/master/prj/project/ipcore/SPI_FIFO_MISO1/SPI_FIFO_MISO1.idf"
add_design "E:/FPGA/ainuo/BTS7501/master/prj/project/ipcore/SPI_FIFO_MISO2/SPI_FIFO_MISO2.idf"
add_design "E:/FPGA/ainuo/BTS7501/master/prj/project/ipcore/SPI_FIFO_MISO3/SPI_FIFO_MISO3.idf"
add_design "E:/FPGA/ainuo/BTS7501/master/prj/project/ipcore/SPI_FIFO_MISO4/SPI_FIFO_MISO4.idf"
add_design "E:/FPGA/ainuo/BTS7501/master/prj/project/ipcore/FIFO_TX/FIFO_TX.idf"
add_design "E:/FPGA/ainuo/BTS7501/master/prj/project/ipcore/FIFO_RX/FIFO_RX.idf"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/COM_ANALYSE.v" -library work
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/define.v" -library work
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/EDGE_CKECK.v" -library work
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/FT600Q_DRIVE.v" -library work
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/MASTER_TOP.v" -library work
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/PULSE_EXPAND.v" -library work
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/SPI_DRIVE.v" -library work
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/CLK_DRIVER.v" -library work
add_design "E:/FPGA/ainuo/BTS7501/master/rtl/ADS1247_DRIVE.v" -library work
add_constraint "E:/FPGA/ainuo/BTS7501/master/prj/project/source/pin.fdc"
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
add_constraint "E:/FPGA/ainuo/BTS7501/master/prj/project/source/pin_7_extracted.fdc"
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
add_fic "E:/FPGA/ainuo/BTS7501/master/prj/project/synthesize/MASTER_TOP_syn.fic"
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -ads -selected_syn_tool_opt 2 
remove_design -verilog "E:/FPGA/ainuo/BTS7501/master/rtl/CLK_DRIVER.v"
remove_design -verilog "E:/FPGA/ainuo/BTS7501/master/rtl/ADS1247_DRIVE.v"
remove_design -verilog "E:/FPGA/ainuo/BTS7501/master/rtl/COM_ANALYSE.v"
remove_design -verilog "E:/FPGA/ainuo/BTS7501/master/rtl/EDGE_CKECK.v"
remove_design -verilog "E:/FPGA/ainuo/BTS7501/master/rtl/PULSE_EXPAND.v"
remove_design -verilog "E:/FPGA/ainuo/BTS7501/master/rtl/SPI_DRIVE.v"
remove_design -verilog "E:/FPGA/ainuo/BTS7501/master/rtl/FT600Q_DRIVE.v"
remove_design -verilog "E:/FPGA/ainuo/BTS7501/master/rtl/PULSE_EXPAND.v"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl_orign/ADS1247_DRIVE.v"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl_orign/CLK_DRIVER.v"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl_orign/COM_ANALYSE.v"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl_orign/define.v"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl_orign/EDGE_CKECK.v"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl_orign/FT600Q_DRIVE.v"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl_orign/MASTER_TOP.v"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl_orign/PULSE_EXPAND.v"
add_design "E:/FPGA/ainuo/BTS7501/master/rtl_orign/SPI_DRIVE.v"
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
remove_design -verilog "E:/FPGA/ainuo/BTS7501/master/rtl/MASTER_TOP.v"
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -dir {D:/pango/PDS_2024.2/pango/PDS_2024.2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -dir {D:/pango/PDS_2024.2/pango/PDS_2024.2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
remove_fic "E:/FPGA/ainuo/BTS7501/master/prj/project/synthesize/MASTER_TOP_syn.fic"
set_option max_threads 0
set_arch -family Logos -device PGL50H -speedgrade -6 -package FBG484
compile -top_module {work.MASTER_TOP} 
synthesize -dir {D:/pango/PDS_2024.2/pango/PDS_2024.2/syn/bin/synplify_pro.exe} -ads -selected_syn_tool_opt 2 
dev_map 
place 
route 
route_optimize 
report_timing 
gen_bit_stream 
